
#include <iostream>

#include <Eigen/Dense>
#include <vector>
#include "../include/max_algebra.h"
#include "../include/tropical.h"
#include "../include/method.h"

using namespace Eigen;
using namespace std;


void TestMinMaxApprox(){
    {
        string hint = "5.1. Решение задачи о выборе места работы";
        //5.1. Решение задачи о выборе места работы"
        MaxAlgMatrixXd A1(3,3),A2(3,3),A3(3,3),A4(3,3),A5(3,3),A6(3,3);

        A1 << 1,d(1,4),d(1,2),
                4,1,3,
                2,d(1,3),1;
        A2 << 1,d(1,4),d(1,5),
                4,1,d(1,2),
                5,2,1;
        A3 << 1,3,d(1,3),
                d(1,3),1,1,
                3,1,1;
        A4 << 1,d(1,3),5,
                3,1,7,
                d(1,5),d(1,7),1;
        A5 << 1,1,7,
                1,1,7,
                d(1,7),d(1,7),1;
        A6 << 1,7,9,
                d(1,7),1,5,
                d(1,9),d(1,5),1;


        MaxAlgMatrixXd C(6, 6);
        C << 1, 1,1,4,1,d(1,2),
                1,1,2,4,1,d(1,2),
                1,d(1,2),1,5,3,d(1,2),
                d(1,4),d(1,4),d(1,5),1,d(1,3),d(1,3),
                1,1,d(1,3),3,1,1,
                2,2,2,3,1,1;

        MinMaxLogApprox({A1,A2,A3,A4,A5,A6},C,hint);
    }
    {
        //  Решение задачи 5.2
        string hint = "Решение задачи 5.2";
        MaxAlgMatrixXd A1(4,4),A2(4,4),A3(4,4),A4(4,4),A5(4,4);
        A1 << 1,d(1,2),1,d(1,2),
                2,1,d(5,2),1,
                1,d(2,5),1,d(2,5),
                2,1,d(5,2),1;
        A2 << 1,2,d(1,3),4,
                d(1,2),1,d(1,8),2,
                3,8,1,9,
                d(1,4),d(1,2),d(1,9),1;
        A3 << 1,5,d(1,2),d(5,2),
                d(1,5),1,d(1,9),d(1,4),
                2,9,1,7,
                d(2,5),4,d(1,7),1;
        A4 << 1,d(1,2),3,4,
                2,1,6,8,
                d(1,3),d(1,6),1,1,
                d(1,4),d(1,8),1,1;
        A5 << 1,d(3,2),d(1,2),4,
                d(2,3),1,d(2,7),d(5,2),
                2,d(7,2),1,9,
                d(1,4),d(2,5),d(1,9),1;
        
        MaxAlgMatrixXd C(5, 5);
        C << 1,d(1,5),3,d(1,2),5,
                5,1,7,1,7,
                d(1,3),d(1,7),1,d(1,4),3,
                2,1,4,1,7,
                d(1,5),d(1,7),d(1,3),d(1,7),1;


        MinMaxLogApprox({A1,A2,A3,A4,A5},C,hint);
    }

}
int main()
{

    TestMinMaxApprox();

    return 0;
}


